<!DOCTYPE html>
<html>
  <head>
    <title>Sistema de Recomenda&ccedil;&atilde;o</title>
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
    <meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
    <meta name="viewport" content="width=device-width, height=device-height, initial-scale=1, maximum-scale=1, user-scalable=no" />

    <link rel="stylesheet" type="text/css" href="css/style.css" />
    <link rel="stylesheet" type="text/css" href="css/footer.css" />
    <link rel="stylesheet" type="text/css" href="css/index.css" />

  </head>
  <body>
              <header>
                    <div id="logo-zenit" class="float-l">
                                    <a href="http://www.unb.br/" target="_blank"><img src="imagens/Logo.jpg" /></a>
                    </div>
                     <input type="checkbox" id="control-nav" />
                     <label for="control-nav" class="control-nav"></label>
                      <label for="control-nav" class="control-nav-close"></label>

            <nav class="float-r">
              <ul class="list-auto">
                 <li>
                  <a href="#">Home</a>
                </li>
                <li>
                  <a href="#">Acesso Institucional</a>
                </li>
                <li>
                  <a href="#">Acesso ao Moodle</a>
                </li>
                <li>
                  <a href="#">Acesso ao SAE</a>
                </li>
        <li>
                  <a href="#">Monitoria</a>
                </li>
        <li>
                  <a href="#">Colaboradores</a>
                </li>
              </ul>

            </nav>
           </header>

       <section class="body-principal">
        <div id="text-principal">
        <h1 id="body-normal">Sistema de Recomenda&ccedil;&atilde;o</h1>
        </div>

      </section>

      <section class="perspectivas-principal">
      <hr />
  <section class="lateral-menu-conteudo">
    <div class="image">
      <img src="imagens/titleBar.png" style="float:center; width:100%" />
      <div id="menu_title_bar">
        Conte&uacute;dos
      </div>
    </div>
    <ul>
      <hr />
        <li><a href="index.html">Introdu&ccedil;&atilde;o</a></li>
      <hr />
        <li><a href="estilos_de_aprendizagem.html">Estilos de Aprendizagem</a></li>
      <hr />
        <li><a href="sistema_de_recomendacao.html">Sistema de Recomenda&ccedil;&atilde;o</a></li>
      <hr />
        <li><a href="#">Pesquisa Sistema de Recomenda&ccedil;&atilde;o</a></li>
      <hr />
        <li><a href="usando.html">Usando Sistema de Recomenda&ccedil;&atilde;o no SAE</a></li>
      <hr />
      <li><a href="#">Exemplos no Sistema de Recomenda&ccedil;&atilde;o</a></li>
      <hr />
        <li><a href="exercicios_estilos.html">Exerc&iacute;cios sobre Estilos de Aprendizagem</a></li>
      <hr />
        <li><a href="bibliografia.html">Bibliografia</a></li>
      <hr />
    </ul>
  </section>
      <div id="content_text">
    <div class="title_bar">
      <img src="imagens/greenbar.png" style="float:center; width:100%" />
      <h2>Sistema de Recomenda&ccedil;&atilde;o</h2>
     </div>
     <figure class="image_left">
       <img src="imagens/sistema_de_recomendacao4.png" style="width:60%"/>
       <figcaption>Figura 1 - sistema de recomendações.</figcaption>
     </figure>
        <p>
          Estilo de Aprendizagem &eacute; a pref&ecirc;rencia da forma como cada pessoa/estudante
          recebe e processa dados e informa&ccedil;&otilde;es (Felder 1996). Os aprendizes podem
          preferir o estudo sobre informa&ccedil;&otilde;es visuais, fatos e esquemas representativos
          ou podem ficar mais confortáveis com o estudo de teorias e modelos matemáticos.
          Desta forma o SR pretende estabelecer um processo educacional mais agrad&aacute;vel
          a cada aprendiz, respeitando essas pref&ecirc;rencias.
        </p>

        <p>
          O SR se aprofundou na proposta de
          Alonso e Galego (2002), já citada no tópico
          <a href="estilos_de_aprendizagem.html#Galego_Alonso">estilos de aprendizagem</a>.
        </p></br>

        <p>
          Essa pretens&atilde;o do SR funciona em contraste com a educa&ccedil;&atilde;o
          homog&ecirc;nea, pois esta n&atilde;o consegue atingir os estudantes de
          forma justa e igualit&aacute;ria, as vezes exigindo, de alguns estudantes,
          um esfor&ccedil;o superior, em compara&ccedil;&atilde;o a outros estudantes da mesma
          classe, para obten&ccedil;&atilde;o de notas iguais ou at&eacute;
          mesmo inferiores. (Cavellucci, 2014)
        </p>

        <p>
          Um Sistema de Recomenda&ccedil;&atilde;o combina v&aacute;rias t&eacute;cnicas
          computacionais para selecionar itens personalizados com base nos interesses
          dos usu&aacute;rios e conforme o contexto no qual est&atilde;o inseridos.
          Tais itens podem assumir formas bem variadas como, por exemplo, livros, filmes,
          not&iacute;cias, m&uacute;sica, v&iacute;deos, an&uacute;ncios, links patrocinados,
          p&aacute;ginas de internet, produtos de uma loja virtual, etc.
        </p>

        <p>
          O Sistema Tutor Inteligente, chamado Sistema de Recomenda&ccedil;&atilde;es
          (SR), foi criado com o objetivo de auxiliar os estudantes nos seus estudos,
          auxiliando-os com base em sua intera&ccedil;&atilde;o com o pr&oacute;prio
          sistema. Para o funcionamento do sistema de forma coerente e precisa &eacute;
           necess&aacute;rio que o professor recomende para o sistema artigos ou s&iacute;tios
            virtuais como um recurso complementar à aprendizagem do estudante na
            disciplina. (VIANA e BUENO, 2014)
        </p>

        <p>
          De acordo com isso podemos dizer que o perfil do professor &eacute; um dos
          principais perfis para o SR, pois &eacute; sua a responsabilidade de analisar e
          cadastrar os conte&uacute;dos ou m&iacute;dias que sejam mais adequados
          aos conte&uacute;dos espec&iacute;ficos sobre os t&oacute;picos que formam
          sua disciplina. Desta forma o sistema poder&aacute; recomendar
          conte&uacute;dos que sejam relevantes e coerentes para o estudante no
          seu processo de aprendizagem.
        </p>

        <p>
          O SR &eacute; capaz de garantir maior confiabilidade e seguran&ccedil;a
          às pesquisas educacionais relacionadas a forma&ccedil;&atilde;o de estudantes,
          al&eacute;m de economizar o tempo dos aprendizes ou o seu melhor
          investimento em atividades que propiciem uma aprendizagem de qualidade.
          Barcellos (2007) define os Sistemas de Recomenda&ccedil;&otilde;o como
          “utilizados para identificar usu&aacute;rios, armazenar suas prefer&ecirc;ncias e
          recomendar itens que podem ser produtos, servi&ccedil;os e/ou conte&uacute;dos,
           de acordo com suas necessidades e interesses”.
        </p>

        <p>
          As recomenda&ccedil;&atilde;es s&atilde;o analisadas pelo professor ou pelo
          corpo docente respons&aacute;vel pela disciplina. E o tamb&eacute;m &eacute;
           capaz de recomendar colegas de turma que tenham um rendimento melhor
           e suficiente em um conte&uacute;do espec&iacute;fico ou recomendar monitores.
        </p>

        <figure class="image_center">
          <img src="imagens/sistema_de_recomendacao6.jpeg" style="width:60%"/>
          <figcaption>Figura 2 - sistema de recomendações.</figcaption>
        </figure>

        <p>
          O sistema avalia explicitamente, por meio de defini&ccedil;&otilde;es de
          prefer&ecirc;ncias do estudante, e implicitamente, por meio da
          observa&ccedil;&atilde;o das a&ccedil;&otilde;es do estudante. Por isso &eacute;
           importante que o estudante comente nos conte&uacute;dos recomendados e avalie-os.
        </p>

        <p>
          S&atilde;o 2 as estrat&eacute;gias de recomenda&ccedil;&atilde;o utilizadas no SR, que
          foram propostas por Barcellos(2007):
        </p>

          <p>
            <ul style="text-align: justify; margin-left: 30px; ">
              <li><strong>Filtragem de informa&ccedil;&atilde;o:</strong>
                Essa t&eacute;cnica pode ser baseada em conte&uacute;do, colaborativa ou
                h&iacute;brida. A filtragem baseada em conte&uacute;do recomenda itens
                semelhantes com os que o usu&aacute;rio j&aacute; tenha demostrado
                interesse no passado. Na t&eacute;cnica de Filtragem Colaborativa as
                 recomenda&ccedil;&otilde;es s&atilde;o feitas com base nas
                  semelhan&ccedil;as entre os interesses ou prefer&ecirc;ncias dos
                  usu&aacute;rios. A abordagem h&iacute;brida consiste do uso m&uacute;tuo
                  dessas t&eacute;cnicas.
              </li><br />

              <li><strong>Sumariza&ccedil;&atilde;o Estat&iacute;stica:</strong>
                Encarrega-se da constru&ccedil;&atilde;o de uma opini&atilde;o geral a
                respeito de determinados itens de um sítio virtual, por meio da an&aacute;lise
                 cr&iacute;tica contida nas avalia&ccedil;&atilde;es individuais dos
                 usu&aacute;rios referentes aos objetos em quest&atilde;o.
              </li><br />

            </ul>
          </p>
       </p>

      </div>

      </section>

        <footer class="copyright">

                        <p class="footer-copy" >
                            Copyright &copy; - Universidade de Bras&iacute;lia - 2015
                        </p>
        </footer>

   </body>
</html>
