<!DOCTYPE html>
<html>
  <head>
    <title>Sistema de Recomenda&ccedil;&atilde;o</title>
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
    <meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
    <meta name="viewport" content="width=device-width, height=device-height, initial-scale=1, maximum-scale=1, user-scalable=no" />

    <link rel="stylesheet" type="text/css" href="css/style.css" />
    <link rel="stylesheet" type="text/css" href="css/footer.css" />
    <link rel="stylesheet" type="text/css" href="css/index.css" />

  </head>
  <body>
              <header>
                    <div id="logo-zenit" class="float-l">
                                    <a href="http://www.unb.br/" target="_blank"><img src="imagens/Logo.jpg" /></a>
                    </div>
                     <input type="checkbox" id="control-nav" />
                     <label for="control-nav" class="control-nav"></label>
                      <label for="control-nav" class="control-nav-close"></label>

            <nav class="float-r">
              <ul class="list-auto">
                 <li>
                  <a href="index.html">Home</a>
                </li>
                 <li>
                  <a href="http://www.se.df.gov.br/" target="_blank">Acesso Institucional</a>
                </li>
                <li>
                  <a href="http://avaliacao.se.df.gov.br/?page_id=236" target="_blank">Acesso ao Moodle</a>
                </li>
                <li>
                  <a href="http://sae.se.df.gov.br/sae/" target="_blank">Acesso ao SAE</a>
                </li>
                <li>
                  <a href="#">Monitoria</a>
                </li>
                 <li>
                  <a href="sr_colaboradores.html">Colaboradores</a>
                </li>
              </ul>

            </nav>
           </header>

       <section class="body-principal">
        <div id="text-principal">
        <h1 id="body-normal">Sistema de Recomenda&ccedil;&atilde;o</h1>
        </div>

      </section>

      <section class="perspectivas-principal">
      <hr />
	<section class="lateral-menu-conteudo">
		<div class="image">
			<img src="imagens/titleBar.png" style="float:center; width:100%" />
			<div id="menu_title_bar">
				Conte&uacute;dos
			</div>
	 	</div>
		<ul>
			<hr />
				<li><a href="index.html">Introdu&ccedil;&atilde;o</a></li>
			<hr />
				 <li><a href="sr_estilosDeAprendizagem.html">Estilos de Aprendizagem</a></li>
      <hr />
        <li><a href="sr_sistemaDeRecomendacao.html">Sistema de Recomenda&ccedil;&atilde;o</a></li>
      <hr />
       <li><a href="#">Pesquisa Sistema de Recomenda&ccedil;&atilde;o</a></li>
      <hr />
				<li><a href="sr_usandoSRNoSAE.html">Usando Sistema de Recomenda&ccedil;&atilde;o no SAE</a></li>
			<hr />
				<li><a href="sr_exemplosDeUsoDoSR.html">Exemplos no Sistema de Recomenda&ccedil;&atilde;o</a></li>
      <hr />
				<li><a href="exercicios/sr_exerPesquisaSR.html">Exerc&iacute;cios sobre Pesquisa SR</a></li>
			<hr />
				<li><a href="sr_bibliografia.html">Bibliografia</a></li>
			<hr />
		</ul>
	</section>
      <div id="content_text">
		<div class="title_bar">
			<img src="imagens/greenbar.png" style="float:center; width:100%" />
			<h2>Pesquisa Sistema de Recomenda&ccedil;&atilde;o</h2>

		 </div>

     <br />

     <p>
        Sistemas de recomenda&ccedil;&atilde;o que, de acordo com
        CAZELLA et al. (2009) s&atilde;o sistemas que visam auxiliar
        o usu&aacute;rio na busca e sele&ccedil;&atilde;o de um conte&uacute;do
        focado em seu perfil, funcionando literalmente como filtros de
        informa&ccedil;&atilde;o. Assim, o usu&aacute;rio ter&aacute; como
        resultado de busca apenas os materiais mais pr&oacute;ximos e
        relevantes, conforme vai utilizando e alimentando o sistema
        com novas informa&ccedil;&otilde;es seja do seu perfil, seja das pesquisas que realiza.
     </p><br />

     <h4>Objetos de Aprendizagem</h4>
     <p>
        <strong>O</strong>bjetos de <strong>A</strong>prendizagem(OAs) s&atilde;o
        m&oacute;dulos ou unidades de cont&eacute;udos voltados para a aprendizagem
        com apoio das tecnologias digitais (IEE 2002, p. 5 e COLL e MONEREO 2010, p. 252).
        t&ecirc;m como
        caracter&iacute;sticas a possibilidade de serem adaptados, reutilizados,
        acess&iacute;veis, dur&aacute;veis, al&eacute;m de poderem ser utilizados
        em diferentes plataformas (Fabre et al 2003 e Tarouco et al 2004).
        Para tanto, os reposit&oacute;rios de objetos de aprendizagem vem apoiar
        o professor na sele&ccedil;&atilde;o dos recursos, pois s&atilde;o
        bancos de dados que armazenam os objetos visando facilitar o acesso e
        organiza&ccedil;&atilde;o. No entanto, persiste a dificuldade de escolha pela
        grande disponibilidade de op&ccedil;&otilde;es existentes.(CAZELLA, 2012)
     </p>
     <figure class="image_center">
          <img src="imagens/OA1.png" style="width:50%;"/>
      <figcaption>
        Figura 1 - Objetos de Aprendizagem<br/>
      </figcaption>
      </figure>
     <p>
       No contexto educacional, os alunos s&atilde;o expostos a uma grande
       quantidade de OAs que procutam auxili&aacute;-los em sua formação. Neste caso os
       SRs funcionam como filtros de informa&ccedil;&atilde;o encaminhando o objeto
       que melhor atende as necessidades de aprendizado de cada aluno. (CAZELLA, 2012)
     </p><br />


     <h3> Onde &eacute; utilizado? <h3>

      <p>
        A seguir &eacute; apresentado exemplos e prot&oacute;tipos de sistemas de
        recomenda&ccedil;&atilde;o reais.
      </p><br />

      <h4>GroupLens</h4>
     <p>
        O GroupLens constituiu-se em um projeto de pesquisa desenvolvido
        pela Universidade de Minnesota, aplicado &agrave; filtragem
        colaborativa de not&iacute;cias, auxiliando pessoas a encontrar artigos
        de interesse entre um grande volume de artigos ofertados.
        O Sistema coleta a avalia&ccedil;&atilde;o dos usu&aacute;rios referente
        aos artigos lidos (escala de 1-5 pontos) e utiliza esta avalia&ccedil;&atilde;o
        para identificar os vizinhos mais pr&oacute;ximos com avalia&ccedil;&otilde;es
        semelhantes. Desta forma o sistema &eacute; capaz de predizer se um usu&aacute;rio
        pode se interessar por um novo artigo baseando-se
        nas avalia&ccedil;&otilde;es dos usu&aacute;rios vizinhos. (RIEDL, 1997)
     </p><br />
     <figure class="image_center">
          <img src="imagens/logo_groupLens.png" style="width:50%;"/>
      <figcaption>Figura 2 - GroupLens<br/>Fonte:
        <a href="http://grouplens.org/" target="_blank">grouplens.org</a>.
      </figcaption>
      </figure>


      <h4>LorSys</h4>
       <p>
           J&aacute; Ferreira e Raabe, (2010) apresentam o LorSys (Learning Object Recommender
           System), um sistema de recomenda&ccedil;&atilde;o de Objetos de Aprendizagem (OA),
            no formato SCORM (Sharable Content Object Reference Model), para o Ambiente
            Sophia, que &eacute; uma personaliza&ccedil;&atilde;o do Moodle (Modular
           Object-Oriented Dynamic Learning Environment). O LorSys utiliza a t&eacute;cnica
            de recomenda&ccedil;&atilde;o h&iacute;brida, aplicada a informa&ccedil;&otilde;es
            de prefer&ecirc;ncias dos estudantes e dados de acesso aos OAs.
           Apesar disso, tem como ponto fraco o fato de recomendar apenas OAs padronizados e n&atilde;o ser
           sens&iacute;vel ao contexto do usu&aacute;rio.
        </p><br />


      <h4>MobiLE+</h4>
      <p>Costa (2013), utilizando o MobiLE+, apresentou um trabalho que tem como objetivo a concep&ccedil;&atilde;o,
        implementa&ccedil;&atilde;o e apresenta&ccedil;&atilde;o de um modelo sem&acirc;ntico de
        personaliza&ccedil;&atilde;o para recomenda&ccedil;&atilde;o de conte&uacute;do ao
        usu&aacute;rio de acordo com sua prefer&ecirc;ncias e necessidades. O modelo
        &eacute; estruturado e beneficiado pela interoperabilidade, a qual expande
        o espa&ccedil;o de busca para bases de dados heterog&ecirc;neas, permitindo
        a recomenda&ccedil;&atilde;o din&acirc;mica de conte&uacute;do em um maior
        volume de dados e garantindo maior efici&ecirc;ncia &agrave; personaliza&ccedil;&atilde;o.
       </p> <br />

      <h4>Ponto com Filtro</h4>
         <p> Barcellos et al. (2007) apresenta um modelo de refer&ecirc;ncia para Sistema de
          Recomenda&ccedil;&atilde;o que dispensa a interven&ccedil;&atilde;o do usu&aacute;rio
           no momento de tra&ccedil;ar seu perfil e utiliza t&eacute;cnicas de minera&ccedil;&atilde;o
           de dados. O modelo foi implementado
            no prot&oacute;tipo “Ponto com Filtro” para verificar sua aplicabilidade.
        </p><br />

      <h4>RECoaComp</h4>
        <p>
          O RECoaComp (<strong>REC</strong>omemendador de <strong>o</strong>bjetos de
          <strong>a</strong>prendizagem baseado em <strong>Comp</strong>et&ecirc;ncias)
          recomenda conte&uacute;dos baseado em compet&ecirc;ncias, essas
          s&atilde;o relacionadas a uma perspectiva construtivista, onde o estudante
          contr&oacute;i o seu conhecimento, que tem potencial para contribuir com
          a forma&ccedil;&atilde;o integral do estudante. O conte&uacute;do &eacute;
          necess&aacute;rio, mas &eacute; preciso construir conhecimentos sobre eles,
          al&eacute;m de desenvolver habilidades e atitudes, possibilitando a
          express&atilde;o das compet&ecirc;ncias. Tais compet&ecirc;ncias
          s&atilde;o formadas por um conjunto de elementos, a saber:
          <strong>C</strong>onhecimentos,
          <strong>H</strong>abilidades e <strong>A</strong>titudes
          (<strong>CHA</strong>)(CAZELLA, 2012). Le Boterf (2004) prop&otilde;e que a
          compet&ecirc;ncia seja concebida como a capacidade de mobilizar
          esse conjunto de recursos para enfrentar uma situa&ccedil;&atilde;o
          complexa. Desse modo “a compet&ecirc;ncia [...] reside [...] na
          pr&oacute;pria mobiliza&ccedil;&atilde;o desses
          recursos. A compet&ecirc;ncia pertence &agrave; ordem do saber mobilizar”.
        </p>
        <figure class="image_center">
             <img src="imagens/recoacomp-logo.png" style="width:50%;"/>
         <figcaption>Figura 3 - RECoaComp<br/>Fonte:
           <a href="http://www.nuted.ufrgs.br/wordpress_beta/?page_id=1971" target="_blank">http://www.nuted.ufrgs.br/</a>.
         </figcaption>
         </figure>
        <p>
          Passos b&aacute;sicos do sistema RECoaComp:
        </p><br />
        <ol>
          <li>
            O professor da disciplina seleciona quais objetos de aprendizagem
            provenientes de um reposit&oacute;rio ir&aacute; utilizar com a
            sua turma, visando a constru&ccedil;&atilde;o de compet&ecirc;ncias
            espec&iacute;ficas. Ele atribui as compet&ecirc;ncias que esses
            objetos podem ajudar a suprir. Salienta-se que um OA pode atender
            mais de uma compet&ecirc;ncia espec&iacute;fica.
          </li><br />
          <li>
            Os alunos respondem a um question&aacute;rio acerca das compet&eacute;ncias relevantes
            para a disciplina (j&aacute; definidas pelo professor), realizando uma auto-avalia&ccedil;&atilde;o,
            viabilizando a recomenda&ccedil;&atilde;o de OAs.
          </li><br />
          <li>
            Atrav&eacute;s da busca, &eacute; acionada a filtragem de informa&ccedil;&atilde;o, selecionando e
            recomendando Objetos de Aprendizagem aos alunos. Estes objetos s&atilde;o selecionados
            diretamente do reposit&aacute;rio escolhido, atrav&eacute;s de seus metadados cadastrados,
            relacionado o objeto e os dados do perfil, especialmente quanto &agrave;s compet&ecirc;ncias.
          </li><br />
        </ol>

     </br>
   </ul>

      </section>

        <footer class="copyright">

                        <p class="footer-copy" >
                            Copyright &copy; - Universidade de Bras&iacute;lia - 2015
                        </p>
        </footer>

   </body>
</html>
